micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dma.h
  __IO HAL_DMA_StateTypeDef State;                                 /*!< DMA transfer state                      */

  __IO uint32_t             ErrorCode;                             /*!< DMA error code                          */

  void                      *Parent;                               /*!< Parent object state                     */

  void (* XferCpltCallback)(struct __DMA_HandleTypeDef *hdma);     /*!< DMA transfer complete callback          */

  void (* XferHalfCpltCallback)(struct __DMA_HandleTypeDef *hdma); /*!< DMA half transfer complete callback     */

  void (* XferErrorCallback)(struct __DMA_HandleTypeDef *hdma);    /*!< DMA transfer error callback             */

  void (* XferAbortCallback)(struct __DMA_HandleTypeDef *hdma);    /*!< DMA transfer Abort callback             */

  void (* XferSuspendCallback)(struct __DMA_HandleTypeDef *hdma);  /*!< DMA transfer Suspend callback           */

  struct __DMA_QListTypeDef  *LinkedListQueue;                     /*!< DMA linked-list queue                   */

} DMA_HandleTypeDef;
/**
  * @}
  */


/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup DMA_Exported_Constants DMA Exported Constants
  * @brief    DMA Exported constants
  * @{
  */

/** @defgroup DMA_Error_Codes DMA Error Codes
  * @brief    DMA Error Codes
  * @{
  */
#define HAL_DMA_ERROR_NONE             (0x0000U) /*!< No error                      */
#define HAL_DMA_ERROR_DTE              (0x0001U) /*!< Data transfer error           */
#define HAL_DMA_ERROR_ULE              (0x0002U) /*!< Update linked-list item error */
#define HAL_DMA_ERROR_USE              (0x0004U) /*!< User setting error            */
#define HAL_DMA_ERROR_TO               (0x0008U) /*!< Trigger overrun error         */
#define HAL_DMA_ERROR_TIMEOUT          (0x0010U) /*!< Timeout error                 */
#define HAL_DMA_ERROR_NO_XFER          (0x0020U) /*!< No transfer ongoing error     */
#define HAL_DMA_ERROR_BUSY             (0x0040U) /*!< Busy error                    */
#define HAL_DMA_ERROR_INVALID_CALLBACK (0x0080U) /*!< Invalid callback error        */
#define HAL_DMA_ERROR_NOT_SUPPORTED    (0x0100U) /*!< Not supported mode            */
/**
  * @}
  */

/** @defgroup DMA_Interrupt_Enable_Definition DMA Interrupt Enable Definition
  * @brief    DMA Interrupt Enable Definition
  * @{
  */
#define DMA_IT_TC   DMA_CCR_TCIE   /*!< Transfer complete interrupt             */
#define DMA_IT_HT   DMA_CCR_HTIE   /*!< Half transfer complete interrupt        */
#define DMA_IT_DTE  DMA_CCR_DTEIE  /*!< Data transfer error interrupt           */
#define DMA_IT_ULE  DMA_CCR_ULEIE  /*!< Update linked-list item error interrupt */
#define DMA_IT_USE  DMA_CCR_USEIE  /*!< User eetting error interrupt            */
#define DMA_IT_SUSP DMA_CCR_SUSPIE /*!< Completed suspension interrupt          */
#define DMA_IT_TO   DMA_CCR_TOIE   /*!< Trigger overrun interrupt               */
/**
  * @}
  */

/** @defgroup DMA_Flag_Definition DMA Flag Definition
  * @brief    DMA Flag Definition
  * @{
  */
#define DMA_FLAG_IDLE DMA_CSR_IDLEF /*!< Idle flag                          */
#define DMA_FLAG_TC   DMA_CSR_TCF   /*!< Transfer complete flag             */
#define DMA_FLAG_HT   DMA_CSR_HTF   /*!< Half transfer complete flag        */
#define DMA_FLAG_DTE  DMA_CSR_DTEF  /*!< Data transfer error flag           */
#define DMA_FLAG_ULE  DMA_CSR_ULEF  /*!< Update linked-list item error flag */
#define DMA_FLAG_USE  DMA_CSR_USEF  /*!< User setting error flag            */
#define DMA_FLAG_SUSP DMA_CSR_SUSPF /*!< Completed suspension flag          */
#define DMA_FLAG_TO   DMA_CSR_TOF   /*!< Trigger overrun flag               */
/**
  * @}
  */

/** @defgroup DMA_Request_Selection DMA Request Selection
  * @brief    DMA Request Selection
  * @{
  */
/* HPDMA1 requests */
#define HPDMA1_REQUEST_JPEG_RX        0U       /*!< HPDMA1 HW request is JPEG_RX        */
#define HPDMA1_REQUEST_JPEG_TX        1U       /*!< HPDMA1 HW request is JPEG_TX        */
#define HPDMA1_REQUEST_XSPI1          2U       /*!< HPDMA1 HW request is XSPI1          */
#define HPDMA1_REQUEST_XSPI2          3U       /*!< HPDMA1 HW request is XSPI2          */
#define HPDMA1_REQUEST_XSPI3          4U       /*!< HPDMA1 HW request is XSPI3          */
#define HPDMA1_REQUEST_FMC2_TXRX      5U       /*!< HPDMA1 HW request is FMC2_TXRX      */
#define HPDMA1_REQUEST_FMC2_BCH       6U       /*!< HPDMA1 HW request is FMC2_BCH       */
#define HPDMA1_REQUEST_ADC1           7U       /*!< HPDMA1 HW request is ADC1           */
#define HPDMA1_REQUEST_ADC2           8U       /*!< HPDMA1 HW request is ADC2           */
#define HPDMA1_REQUEST_CRYP_IN        9U       /*!< HPDMA1 HW request is CRYP_IN        */
#define HPDMA1_REQUEST_CRYP_OUT       10U      /*!< HPDMA1 HW request is CRYP_OUT       */
#define HPDMA1_REQUEST_SAES_OUT       11U      /*!< HPDMA1 HW request is SAES_OUT       */
#define HPDMA1_REQUEST_SAES_IN        12U      /*!< HPDMA1 HW request is SAES_IN        */
#define HPDMA1_REQUEST_HASH_IN        13U      /*!< HPDMA1 HW request is HASH_IN        */

#define HPDMA1_REQUEST_TIM1_CH1       14U      /*!< HPDMA1 HW request is TIM1_CH1       */
#define HPDMA1_REQUEST_TIM1_CH2       15U      /*!< HPDMA1 HW request is TIM1_CH2       */
#define HPDMA1_REQUEST_TIM1_CH3       16U      /*!< HPDMA1 HW request is TIM1_CH3       */
#define HPDMA1_REQUEST_TIM1_CH4       17U      /*!< HPDMA1 HW request is TIM1_CH4       */
#define HPDMA1_REQUEST_TIM1_UP        18U      /*!< HPDMA1 HW request is TIM1_UP        */
#define HPDMA1_REQUEST_TIM1_TRIG      19U      /*!< HPDMA1 HW request is TIM1_TRIG      */
#define HPDMA1_REQUEST_TIM1_COM       20U      /*!< HPDMA1 HW request is TIM1_COM       */

#define HPDMA1_REQUEST_TIM2_CH1       21U      /*!< HPDMA1 HW request is TIM2_CH1       */
#define HPDMA1_REQUEST_TIM2_CH2       22U      /*!< HPDMA1 HW request is TIM2_CH2       */
#define HPDMA1_REQUEST_TIM2_CH3       23U      /*!< HPDMA1 HW request is TIM2_CH3       */
#define HPDMA1_REQUEST_TIM2_CH4       24U      /*!< HPDMA1 HW request is TIM2_CH4       */
#define HPDMA1_REQUEST_TIM2_UP        25U      /*!< HPDMA1 HW request is TIM2_UP        */
#define HPDMA1_REQUEST_TIM2_TRIG      26U      /*!< HPDMA1 HW request is TIM2_TRIG      */

