micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dma.h
#define HPDMA1_REQUEST_TIM3_CH1       27U      /*!< HPDMA1 HW request is TIM3_CH1       */
#define HPDMA1_REQUEST_TIM3_CH2       28U      /*!< HPDMA1 HW request is TIM3_CH2       */
#define HPDMA1_REQUEST_TIM3_CH3       29U      /*!< HPDMA1 HW request is TIM3_CH3       */
#define HPDMA1_REQUEST_TIM3_CH4       30U      /*!< HPDMA1 HW request is TIM3_CH4       */
#define HPDMA1_REQUEST_TIM3_UP        31U      /*!< HPDMA1 HW request is TIM3_UP        */
#define HPDMA1_REQUEST_TIM3_TRIG      32U      /*!< HPDMA1 HW request is TIM3_TRIG      */

#define HPDMA1_REQUEST_TIM4_CH1       33U      /*!< HPDMA1 HW request is TIM4_CH1       */
#define HPDMA1_REQUEST_TIM4_CH2       34U      /*!< HPDMA1 HW request is TIM4_CH2       */
#define HPDMA1_REQUEST_TIM4_CH3       35U      /*!< HPDMA1 HW request is TIM4_CH3       */
#define HPDMA1_REQUEST_TIM4_CH4       36U      /*!< HPDMA1 HW request is TIM4_CH4       */
#define HPDMA1_REQUEST_TIM4_UP        37U      /*!< HPDMA1 HW request is TIM4_UP        */
#define HPDMA1_REQUEST_TIM4_TRIG      38U      /*!< HPDMA1 HW request is TIM4_TRIG      */

#define HPDMA1_REQUEST_TIM5_CH1       39U      /*!< HPDMA1 HW request is TIM5_CH1       */
#define HPDMA1_REQUEST_TIM5_CH2       40U      /*!< HPDMA1 HW request is TIM5_CH2       */
#define HPDMA1_REQUEST_TIM5_CH3       41U      /*!< HPDMA1 HW request is TIM5_CH3       */
#define HPDMA1_REQUEST_TIM5_CH4       42U      /*!< HPDMA1 HW request is TIM5_CH4       */
#define HPDMA1_REQUEST_TIM5_UP        43U      /*!< HPDMA1 HW request is TIM5_UP        */
#define HPDMA1_REQUEST_TIM5_TRIG      44U      /*!< HPDMA1 HW request is TIM5_TRIG      */

#define HPDMA1_REQUEST_TIM6_UP        45U      /*!< HPDMA1 HW request is TIM6_UP        */
#define HPDMA1_REQUEST_TIM7_UP        46U      /*!< HPDMA1 HW request is TIM7_UP        */

#define HPDMA1_REQUEST_TIM8_CH1       47U      /*!< HPDMA1 HW request is TIM8_CH1       */
#define HPDMA1_REQUEST_TIM8_CH2       48U      /*!< HPDMA1 HW request is TIM8_CH2       */
#define HPDMA1_REQUEST_TIM8_CH3       49U      /*!< HPDMA1 HW request is TIM8_CH3       */
#define HPDMA1_REQUEST_TIM8_CH4       50U      /*!< HPDMA1 HW request is TIM8_CH4       */
#define HPDMA1_REQUEST_TIM8_UP        51U      /*!< HPDMA1 HW request is TIM8_UP        */
#define HPDMA1_REQUEST_TIM8_TRIG      52U      /*!< HPDMA1 HW request is TIM8_TRIG      */
#define HPDMA1_REQUEST_TIM8_COM       53U      /*!< HPDMA1 HW request is TIM8_COM       */

/* reserved                           54U                                               */
/* reserved                           55U                                               */

#define HPDMA1_REQUEST_TIM15_CH1      56U      /*!< HPDMA1 HW request is TIM15_CH1      */
#define HPDMA1_REQUEST_TIM15_CH2      57U      /*!< HPDMA1 HW request is TIM15_CH2      */
#define HPDMA1_REQUEST_TIM15_UP       58U      /*!< HPDMA1 HW request is TIM15_UP       */
#define HPDMA1_REQUEST_TIM15_TRIG     59U      /*!< HPDMA1 HW request is TIM15_TRIG     */
#define HPDMA1_REQUEST_TIM15_COM      60U      /*!< HPDMA1 HW request is TIM15_COM      */

#define HPDMA1_REQUEST_TIM16_CH1      61U      /*!< HPDMA1 HW request is TIM16_CH1      */
#define HPDMA1_REQUEST_TIM16_UP       62U      /*!< HPDMA1 HW request is TIM16_UP       */
#define HPDMA1_REQUEST_TIM16_COM      63U      /*!< HPDMA1 HW request is TIM16_COM      */

#define HPDMA1_REQUEST_TIM17_CH1      64U      /*!< HPDMA1 HW request is TIM17_CH1      */
#define HPDMA1_REQUEST_TIM17_UP       65U      /*!< HPDMA1 HW request is TIM17_UP       */
#define HPDMA1_REQUEST_TIM17_COM      66U      /*!< HPDMA1 HW request is TIM17_COM      */

#define HPDMA1_REQUEST_TIM18_CH1      67U      /*!< HPDMA1 HW request is TIM18_CH1      */
#define HPDMA1_REQUEST_TIM18_UP       68U      /*!< HPDMA1 HW request is TIM18_UP       */
#define HPDMA1_REQUEST_TIM18_COM      69U      /*!< HPDMA1 HW request is TIM18_COM      */

#define HPDMA1_REQUEST_LPTIM1_IC1     70U      /*!< HPDMA1 HW request is LPTIM1_IC1     */
#define HPDMA1_REQUEST_LPTIM1_IC2     71U      /*!< HPDMA1 HW request is LPTIM1_IC2     */
#define HPDMA1_REQUEST_LPTIM1_UE      72U      /*!< HPDMA1 HW request is LPTIM1_UE      */
#define HPDMA1_REQUEST_LPTIM2_IC1     73U      /*!< HPDMA1 HW request is LPTIM2_IC1     */
#define HPDMA1_REQUEST_LPTIM2_IC2     74U      /*!< HPDMA1 HW request is LPTIM2_IC2     */
#define HPDMA1_REQUEST_LPTIM2_UE      75U      /*!< HPDMA1 HW request is LPTIM2_UE      */
#define HPDMA1_REQUEST_LPTIM3_IC1     76U      /*!< HPDMA1 HW request is LPTIM3_IC1     */
#define HPDMA1_REQUEST_LPTIM3_IC2     77U      /*!< HPDMA1 HW request is LPTIM3_IC2     */
#define HPDMA1_REQUEST_LPTIM3_UE      78U      /*!< HPDMA1 HW request is LPTIM3_UE      */

#define HPDMA1_REQUEST_SPI1_RX        79U      /*!< HPDMA1 HW request is SPI1_RX        */
#define HPDMA1_REQUEST_SPI1_TX        80U      /*!< HPDMA1 HW request is SPI1_TX        */
#define HPDMA1_REQUEST_SPI2_RX        81U      /*!< HPDMA1 HW request is SPI2_RX        */
#define HPDMA1_REQUEST_SPI2_TX        82U      /*!< HPDMA1 HW request is SPI2_TX        */
#define HPDMA1_REQUEST_SPI3_RX        83U      /*!< HPDMA1 HW request is SPI3_RX        */
#define HPDMA1_REQUEST_SPI3_TX        84U      /*!< HPDMA1 HW request is SPI3_TX        */
#define HPDMA1_REQUEST_SPI4_RX        85U      /*!< HPDMA1 HW request is SPI4_RX        */
#define HPDMA1_REQUEST_SPI4_TX        86U      /*!< HPDMA1 HW request is SPI4_TX        */
#define HPDMA1_REQUEST_SPI5_RX        87U      /*!< HPDMA1 HW request is SPI5_RX        */
#define HPDMA1_REQUEST_SPI5_TX        88U      /*!< HPDMA1 HW request is SPI5_TX        */
#define HPDMA1_REQUEST_SPI6_RX        89U      /*!< HPDMA1 HW request is SPI6_RX        */
#define HPDMA1_REQUEST_SPI6_TX        90U      /*!< HPDMA1 HW request is SPI6_TX        */

#define HPDMA1_REQUEST_SAI1_A         91U      /*!< HPDMA1 HW request is SAI1_A         */
#define HPDMA1_REQUEST_SAI1_B         92U      /*!< HPDMA1 HW request is SAI1_B         */
#define HPDMA1_REQUEST_SAI2_A         93U      /*!< HPDMA1 HW request is SAI2_A         */
#define HPDMA1_REQUEST_SAI2_B         94U      /*!< HPDMA1 HW request is SAI2_B         */

#define HPDMA1_REQUEST_I2C1_RX        95U      /*!< HPDMA1 HW request is I2C1_RX        */
#define HPDMA1_REQUEST_I2C1_TX        96U      /*!< HPDMA1 HW request is I2C1_TX        */
#define HPDMA1_REQUEST_I2C2_RX        97U      /*!< HPDMA1 HW request is I2C2_RX        */
#define HPDMA1_REQUEST_I2C2_TX        98U      /*!< HPDMA1 HW request is I2C2_TX        */
#define HPDMA1_REQUEST_I2C3_RX        99U      /*!< HPDMA1 HW request is I2C3_RX        */
#define HPDMA1_REQUEST_I2C3_TX        100U     /*!< HPDMA1 HW request is I2C3_TX        */

#define HPDMA1_REQUEST_I2C4_RX        101U     /*!< HPDMA1 HW request is I2C4_RX        */
#define HPDMA1_REQUEST_I2C4_TX        102U     /*!< HPDMA1 HW request is I2C4_TX        */

