micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dma.h
#define HPDMA1_REQUEST_I3C1_RX        103U     /*!< HPDMA1 HW request is I3C1_RX        */
#define HPDMA1_REQUEST_I3C1_TX        104U     /*!< HPDMA1 HW request is I3C1_TX        */
#define HPDMA1_REQUEST_I3C2_RX        105U     /*!< HPDMA1 HW request is I3C2_RX        */
#define HPDMA1_REQUEST_I3C2_TX        106U     /*!< HPDMA1 HW request is I3C2_TX        */

#define HPDMA1_REQUEST_USART1_RX      107U     /*!< HPDMA1 HW request is USART1_RX      */
#define HPDMA1_REQUEST_USART1_TX      108U     /*!< HPDMA1 HW request is USART1_TX      */
#define HPDMA1_REQUEST_USART2_RX      109U     /*!< HPDMA1 HW request is USART2_RX      */
#define HPDMA1_REQUEST_USART2_TX      110U     /*!< HPDMA1 HW request is USART2_TX      */
#define HPDMA1_REQUEST_USART3_RX      111U     /*!< HPDMA1 HW request is USART3_RX      */
#define HPDMA1_REQUEST_USART3_TX      112U     /*!< HPDMA1 HW request is USART3_TX      */
#define HPDMA1_REQUEST_UART4_RX       113U     /*!< HPDMA1 HW request is UART4_RX       */
#define HPDMA1_REQUEST_UART4_TX       114U     /*!< HPDMA1 HW request is UART4_TX       */
#define HPDMA1_REQUEST_UART5_RX       115U     /*!< HPDMA1 HW request is UART5_RX       */
#define HPDMA1_REQUEST_UART5_TX       116U     /*!< HPDMA1 HW request is UART5_TX       */
#define HPDMA1_REQUEST_USART6_RX      117U     /*!< HPDMA1 HW request is USART6_RX      */
#define HPDMA1_REQUEST_USART6_TX      118U     /*!< HPDMA1 HW request is USART6_TX      */
#define HPDMA1_REQUEST_UART7_RX       119U     /*!< HPDMA1 HW request is UART7_RX       */
#define HPDMA1_REQUEST_UART7_TX       120U     /*!< HPDMA1 HW request is UART7_TX       */
#define HPDMA1_REQUEST_UART8_RX       121U     /*!< HPDMA1 HW request is UART8_RX       */
#define HPDMA1_REQUEST_UART8_TX       122U     /*!< HPDMA1 HW request is UART8_TX       */
#define HPDMA1_REQUEST_UART9_RX       123U     /*!< HPDMA1 HW request is UART9_RX       */
#define HPDMA1_REQUEST_UART9_TX       124U     /*!< HPDMA1 HW request is UART9_TX       */
#define HPDMA1_REQUEST_USART10_RX     125U     /*!< HPDMA1 HW request is USART10_RX     */
#define HPDMA1_REQUEST_USART10_TX     126U     /*!< HPDMA1 HW request is USART10_TX     */

#define HPDMA1_REQUEST_LPUART1_RX     127U     /*!< HPDMA1 HW request is LPUART1_RX     */
#define HPDMA1_REQUEST_LPUART1_TX     128U     /*!< HPDMA1 HW request is LPUART1_TX     */

#define HPDMA1_REQUEST_SPDIFRX_CS     129U     /*!< HPDMA1 HW request is SPDIFRX_CS     */
#define HPDMA1_REQUEST_SPDIFRX_DT     130U     /*!< HPDMA1 HW request is SPDIFRX_DT     */

#define HPDMA1_REQUEST_ADF1_FLT0      131U     /*!< HPDMA1 HW request is ADF1_FLT0      */

#define HPDMA1_REQUEST_MDF1_FLT0      132U     /*!< HPDMA1 HW request is MDF1_FLT0      */
#define HPDMA1_REQUEST_MDF1_FLT1      133U     /*!< HPDMA1 HW request is MDF1_FLT1      */
#define HPDMA1_REQUEST_MDF1_FLT2      134U     /*!< HPDMA1 HW request is MDF1_FLT2      */
#define HPDMA1_REQUEST_MDF1_FLT3      135U     /*!< HPDMA1 HW request is MDF1_FLT3      */
#define HPDMA1_REQUEST_MDF1_FLT4      136U     /*!< HPDMA1 HW request is MDF1_FLT4      */
#define HPDMA1_REQUEST_MDF1_FLT5      137U     /*!< HPDMA1 HW request is MDF1_FLT5      */

#define HPDMA1_REQUEST_UCPD1_TX       138U     /*!< HPDMA1 HW request is UCPD1_TX       */
#define HPDMA1_REQUEST_UCPD1_RX       139U     /*!< HPDMA1 HW request is UCPD1_RX       */

#define HPDMA1_REQUEST_DCMI_PSSI      140U     /*!< HPDMA1 HW request is DCMI_PSSI      */

#define HPDMA1_REQUEST_I3C1_TC        141U     /*!< HPDMA1 HW request is I3C1_TC        */
#define HPDMA1_REQUEST_I3C1_RS        142U     /*!< HPDMA1 HW request is I3C1_RS        */

#define HPDMA1_REQUEST_I3C2_TC        143U     /*!< HPDMA1 HW request is I3C2_TC        */
#define HPDMA1_REQUEST_I3C2_RS        144U     /*!< HPDMA1 HW request is I3C2_RS        */

/* GPDMA1 requests */
#define GPDMA1_REQUEST_JPEG_RX        0U       /*!< GPDMA1 HW request is JPEG_DMA_RX    */
#define GPDMA1_REQUEST_JPEG_TX        1U       /*!< GPDMA1 HW request is JPEG_DMA_TX    */
#define GPDMA1_REQUEST_XSPI1          2U       /*!< GPDMA1 HW request is XSPI1          */
#define GPDMA1_REQUEST_XSPI2          3U       /*!< GPDMA1 HW request is XSPI2          */
#define GPDMA1_REQUEST_XSPI3          4U       /*!< GPDMA1 HW request is XSPI3          */
#define GPDMA1_REQUEST_FMC2_TXRX      5U       /*!< GPDMA1 HW request is FMC2_TXRX      */
#define GPDMA1_REQUEST_FMC2_BCH       6U       /*!< GPDMA1 HW request is FMC2_BCH       */
#define GPDMA1_REQUEST_ADC1           7U       /*!< GPDMA1 HW request is ADC1           */
#define GPDMA1_REQUEST_ADC2           8U       /*!< GPDMA1 HW request is ADC2           */
#define GPDMA1_REQUEST_CRYP_IN        9U       /*!< GPDMA1 HW request is CRYP_IN        */
#define GPDMA1_REQUEST_CRYP_OUT       10U      /*!< GPDMA1 HW request is CRYP_OUT       */
#define GPDMA1_REQUEST_SAES_OUT       11U      /*!< GPDMA1 HW request is SAES_OUT       */
#define GPDMA1_REQUEST_SAES_IN        12U      /*!< GPDMA1 HW request is SAES_IN        */
#define GPDMA1_REQUEST_HASH_IN        13U      /*!< GPDMA1 HW request is HASH_IN        */

#define GPDMA1_REQUEST_TIM1_CH1       14U      /*!< GPDMA1 HW request is TIM1_CH1       */
#define GPDMA1_REQUEST_TIM1_CH2       15U      /*!< GPDMA1 HW request is TIM1_CH2       */
#define GPDMA1_REQUEST_TIM1_CH3       16U      /*!< GPDMA1 HW request is TIM1_CH3       */
#define GPDMA1_REQUEST_TIM1_CH4       17U      /*!< GPDMA1 HW request is TIM1_CH4       */
#define GPDMA1_REQUEST_TIM1_UP        18U      /*!< GPDMA1 HW request is TIM1_UP        */
#define GPDMA1_REQUEST_TIM1_TRIG      19U      /*!< GPDMA1 HW request is TIM1_TRIG      */
#define GPDMA1_REQUEST_TIM1_COM       20U      /*!< GPDMA1 HW request is TIM1_COM       */

#define GPDMA1_REQUEST_TIM2_CH1       21U      /*!< GPDMA1 HW request is TIM2_CH1       */
#define GPDMA1_REQUEST_TIM2_CH2       22U      /*!< GPDMA1 HW request is TIM2_CH2       */
#define GPDMA1_REQUEST_TIM2_CH3       23U      /*!< GPDMA1 HW request is TIM2_CH3       */
#define GPDMA1_REQUEST_TIM2_CH4       24U      /*!< GPDMA1 HW request is TIM2_CH4       */
#define GPDMA1_REQUEST_TIM2_UP        25U      /*!< GPDMA1 HW request is TIM2_UP        */
#define GPDMA1_REQUEST_TIM2_TRIG      26U      /*!< GPDMA1 HW request is TIM2_TRIG      */

#define GPDMA1_REQUEST_TIM3_CH1       27U      /*!< GPDMA1 HW request is TIM3_CH1       */
#define GPDMA1_REQUEST_TIM3_CH2       28U      /*!< GPDMA1 HW request is TIM3_CH2       */
#define GPDMA1_REQUEST_TIM3_CH3       29U      /*!< GPDMA1 HW request is TIM3_CH3       */
#define GPDMA1_REQUEST_TIM3_CH4       30U      /*!< GPDMA1 HW request is TIM3_CH4       */
#define GPDMA1_REQUEST_TIM3_UP        31U      /*!< GPDMA1 HW request is TIM3_UP        */
#define GPDMA1_REQUEST_TIM3_TRIG      32U      /*!< GPDMA1 HW request is TIM3_TRIG      */

#define GPDMA1_REQUEST_TIM4_CH1       33U      /*!< GPDMA1 HW request is TIM4_CH1       */
#define GPDMA1_REQUEST_TIM4_CH2       34U      /*!< GPDMA1 HW request is TIM4_CH2       */
#define GPDMA1_REQUEST_TIM4_CH3       35U      /*!< GPDMA1 HW request is TIM4_CH3       */
#define GPDMA1_REQUEST_TIM4_CH4       36U      /*!< GPDMA1 HW request is TIM4_CH4       */
#define GPDMA1_REQUEST_TIM4_UP        37U      /*!< GPDMA1 HW request is TIM4_UP        */
#define GPDMA1_REQUEST_TIM4_TRIG      38U      /*!< GPDMA1 HW request is TIM4_TRIG      */

