micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dma.h
#define GPDMA1_REQUEST_TIM5_CH1       39U      /*!< GPDMA1 HW request is TIM5_CH1       */
#define GPDMA1_REQUEST_TIM5_CH2       40U      /*!< GPDMA1 HW request is TIM5_CH2       */
#define GPDMA1_REQUEST_TIM5_CH3       41U      /*!< GPDMA1 HW request is TIM5_CH3       */
#define GPDMA1_REQUEST_TIM5_CH4       42U      /*!< GPDMA1 HW request is TIM5_CH4       */
#define GPDMA1_REQUEST_TIM5_UP        43U      /*!< GPDMA1 HW request is TIM5_UP        */
#define GPDMA1_REQUEST_TIM5_TRIG      44U      /*!< GPDMA1 HW request is TIM5_TRIG      */

#define GPDMA1_REQUEST_TIM6_UP        45U      /*!< GPDMA1 HW request is TIM6_UP        */
#define GPDMA1_REQUEST_TIM7_UP        46U      /*!< GPDMA1 HW request is TIM6_UP        */

#define GPDMA1_REQUEST_TIM8_CH1       47U      /*!< GPDMA1 HW request is TIM8_CH1       */
#define GPDMA1_REQUEST_TIM8_CH2       48U      /*!< GPDMA1 HW request is TIM8_CH2       */
#define GPDMA1_REQUEST_TIM8_CH3       49U      /*!< GPDMA1 HW request is TIM8_CH3       */
#define GPDMA1_REQUEST_TIM8_CH4       50U      /*!< GPDMA1 HW request is TIM8_CH4       */
#define GPDMA1_REQUEST_TIM8_UP        51U      /*!< GPDMA1 HW request is TIM8_UP        */
#define GPDMA1_REQUEST_TIM8_TRIG      52U      /*!< GPDMA1 HW request is TIM8_TRIG      */
#define GPDMA1_REQUEST_TIM8_COM       53U      /*!< GPDMA1 HW request is TIM8_COM       */

/* reserved                           54U                                               */
/* reserved                           55U                                               */

#define GPDMA1_REQUEST_TIM15_CH1      56U      /*!< GPDMA1 HW request is TIM15_CH1      */
#define GPDMA1_REQUEST_TIM15_CH2      57U      /*!< GPDMA1 HW request is TIM15_CH2      */
#define GPDMA1_REQUEST_TIM15_UP       58U      /*!< GPDMA1 HW request is TIM15_UP       */
#define GPDMA1_REQUEST_TIM15_TRIG     59U      /*!< GPDMA1 HW request is TIM15_TRIG     */
#define GPDMA1_REQUEST_TIM15_COM      60U      /*!< GPDMA1 HW request is TIM15_COM      */

#define GPDMA1_REQUEST_TIM16_CH1      61U      /*!< GPDMA1 HW request is TIM16_CH1      */
#define GPDMA1_REQUEST_TIM16_UP       62U      /*!< GPDMA1 HW request is TIM16_UP       */
#define GPDMA1_REQUEST_TIM16_COM      63U      /*!< GPDMA1 HW request is TIM16_COM      */

#define GPDMA1_REQUEST_TIM17_CH1      64U      /*!< GPDMA1 HW request is TIM17_CH1      */
#define GPDMA1_REQUEST_TIM17_UP       65U      /*!< GPDMA1 HW request is TIM17_UP       */
#define GPDMA1_REQUEST_TIM17_COM      66U      /*!< GPDMA1 HW request is TIM17_COM      */

#define GPDMA1_REQUEST_TIM18_CH1      67U      /*!< GPDMA1 HW request is TIM18_CH1      */
#define GPDMA1_REQUEST_TIM18_UP       68U      /*!< GPDMA1 HW request is TIM18_UP       */
#define GPDMA1_REQUEST_TIM18_COM      69U      /*!< GPDMA1 HW request is TIM18_COM      */

#define GPDMA1_REQUEST_LPTIM1_IC1     70U      /*!< GPDMA1 HW request is LPTIM1_IC1     */
#define GPDMA1_REQUEST_LPTIM1_IC2     71U      /*!< GPDMA1 HW request is LPTIM1_IC2     */
#define GPDMA1_REQUEST_LPTIM1_UE      72U      /*!< GPDMA1 HW request is LPTIM1_UE      */
#define GPDMA1_REQUEST_LPTIM2_IC1     73U      /*!< GPDMA1 HW request is LPTIM2_IC1     */
#define GPDMA1_REQUEST_LPTIM2_IC2     74U      /*!< GPDMA1 HW request is LPTIM2_IC2     */
#define GPDMA1_REQUEST_LPTIM2_UE      75U      /*!< GPDMA1 HW request is LPTIM2_UE      */
#define GPDMA1_REQUEST_LPTIM3_IC1     76U      /*!< GPDMA1 HW request is LPTIM3_IC1     */
#define GPDMA1_REQUEST_LPTIM3_IC2     77U      /*!< GPDMA1 HW request is LPTIM3_IC2     */
#define GPDMA1_REQUEST_LPTIM3_UE      78U      /*!< GPDMA1 HW request is LPTIM3_UE      */

#define GPDMA1_REQUEST_SPI1_RX        79U      /*!< GPDMA1 HW request is SPI1_RX        */
#define GPDMA1_REQUEST_SPI1_TX        80U      /*!< GPDMA1 HW request is SPI1_TX        */
#define GPDMA1_REQUEST_SPI2_RX        81U      /*!< GPDMA1 HW request is SPI2_RX        */
#define GPDMA1_REQUEST_SPI2_TX        82U      /*!< GPDMA1 HW request is SPI2_TX        */
#define GPDMA1_REQUEST_SPI3_RX        83U      /*!< GPDMA1 HW request is SPI3_RX        */
#define GPDMA1_REQUEST_SPI3_TX        84U      /*!< GPDMA1 HW request is SPI3_TX        */
#define GPDMA1_REQUEST_SPI4_RX        85U      /*!< GPDMA1 HW request is SPI4_RX        */
#define GPDMA1_REQUEST_SPI4_TX        86U      /*!< GPDMA1 HW request is SPI4_TX        */
#define GPDMA1_REQUEST_SPI5_RX        87U      /*!< GPDMA1 HW request is SPI5_RX        */
#define GPDMA1_REQUEST_SPI5_TX        88U      /*!< GPDMA1 HW request is SPI5_TX        */
#define GPDMA1_REQUEST_SPI6_RX        89U      /*!< GPDMA1 HW request is SPI6_RX        */
#define GPDMA1_REQUEST_SPI6_TX        90U      /*!< GPDMA1 HW request is SPI6_TX        */

#define GPDMA1_REQUEST_SAI1_A         91U      /*!< GPDMA1 HW request is SAI1_A         */
#define GPDMA1_REQUEST_SAI1_B         92U      /*!< GPDMA1 HW request is SAI1_B         */
#define GPDMA1_REQUEST_SAI2_A         93U      /*!< GPDMA1 HW request is SAI2_A         */
#define GPDMA1_REQUEST_SAI2_B         94U      /*!< GPDMA1 HW request is SAI2_B         */

#define GPDMA1_REQUEST_I2C1_RX        95U      /*!< GPDMA1 HW request is I2C1_RX        */
#define GPDMA1_REQUEST_I2C1_TX        96U      /*!< GPDMA1 HW request is I2C1_TX        */
#define GPDMA1_REQUEST_I2C2_RX        97U      /*!< GPDMA1 HW request is I2C2_RX        */
#define GPDMA1_REQUEST_I2C2_TX        98U      /*!< GPDMA1 HW request is I2C2_TX        */
#define GPDMA1_REQUEST_I2C3_RX        99U      /*!< GPDMA1 HW request is I2C3_RX        */
#define GPDMA1_REQUEST_I2C3_TX        100U     /*!< GPDMA1 HW request is I2C3_TX        */

#define GPDMA1_REQUEST_I2C4_RX        101U     /*!< GPDMA1 HW request is I2C4_RX        */
#define GPDMA1_REQUEST_I2C4_TX        102U     /*!< GPDMA1 HW request is I2C4_TX        */

#define GPDMA1_REQUEST_I3C1_RX        103U     /*!< GPDMA1 HW request is I3C1_RX        */
#define GPDMA1_REQUEST_I3C1_TX        104U     /*!< GPDMA1 HW request is I3C1_TX        */
#define GPDMA1_REQUEST_I3C2_RX        105U     /*!< GPDMA1 HW request is I3C2_RX        */
#define GPDMA1_REQUEST_I3C2_TX        106U     /*!< GPDMA1 HW request is I3C2_TX        */

#define GPDMA1_REQUEST_USART1_RX      107U     /*!< GPDMA1 HW request is USART1_RX      */
#define GPDMA1_REQUEST_USART1_TX      108U     /*!< GPDMA1 HW request is USART1_TX      */
#define GPDMA1_REQUEST_USART2_RX      109U     /*!< GPDMA1 HW request is USART2_RX      */
#define GPDMA1_REQUEST_USART2_TX      110U     /*!< GPDMA1 HW request is USART2_TX      */
#define GPDMA1_REQUEST_USART3_RX      111U     /*!< GPDMA1 HW request is USART3_RX      */
#define GPDMA1_REQUEST_USART3_TX      112U     /*!< GPDMA1 HW request is USART3_TX      */
#define GPDMA1_REQUEST_UART4_RX       113U     /*!< GPDMA1 HW request is UART4_RX       */
#define GPDMA1_REQUEST_UART4_TX       114U     /*!< GPDMA1 HW request is UART4_TX       */
#define GPDMA1_REQUEST_UART5_RX       115U     /*!< GPDMA1 HW request is UART5_RX       */
#define GPDMA1_REQUEST_UART5_TX       116U     /*!< GPDMA1 HW request is UART5_TX       */
#define GPDMA1_REQUEST_USART6_RX      117U     /*!< GPDMA1 HW request is USART6_RX      */
#define GPDMA1_REQUEST_USART6_TX      118U     /*!< GPDMA1 HW request is USART6_TX      */
#define GPDMA1_REQUEST_UART7_RX       119U     /*!< GPDMA1 HW request is UART7_RX       */
#define GPDMA1_REQUEST_UART7_TX       120U     /*!< GPDMA1 HW request is UART7_TX       */
#define GPDMA1_REQUEST_UART8_RX       121U     /*!< GPDMA1 HW request is UART8_RX       */
#define GPDMA1_REQUEST_UART8_TX       122U     /*!< GPDMA1 HW request is UART8_TX       */
#define GPDMA1_REQUEST_UART9_RX       123U     /*!< GPDMA1 HW request is UART9_RX       */
#define GPDMA1_REQUEST_UART9_TX       124U     /*!< GPDMA1 HW request is UART9_TX       */
#define GPDMA1_REQUEST_USART10_RX     125U     /*!< GPDMA1 HW request is USART10_RX     */
#define GPDMA1_REQUEST_USART10_TX     126U     /*!< GPDMA1 HW request is USART10_TX     */

#define GPDMA1_REQUEST_LPUART1_RX     127U     /*!< GPDMA1 HW request is LPUART1_RX     */
#define GPDMA1_REQUEST_LPUART1_TX     128U     /*!< GPDMA1 HW request is LPUART1_TX     */

