micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_dma.h
#define GPDMA1_REQUEST_SPDIFRX_CS     129U     /*!< GPDMA1 HW request is SPDIFRX_CS     */
#define GPDMA1_REQUEST_SPDIFRX_DT     130U     /*!< GPDMA1 HW request is SPDIFRX_DT     */

#define GPDMA1_REQUEST_ADF1_FLT0      131U     /*!< GPDMA1 HW request is ADF1_FLT0      */

#define GPDMA1_REQUEST_MDF1_FLT0      132U     /*!< GPDMA1 HW request is MDF1_FLT0      */
#define GPDMA1_REQUEST_MDF1_FLT1      133U     /*!< GPDMA1 HW request is MDF1_FLT1      */
#define GPDMA1_REQUEST_MDF1_FLT2      134U     /*!< GPDMA1 HW request is MDF1_FLT2      */
#define GPDMA1_REQUEST_MDF1_FLT3      135U     /*!< GPDMA1 HW request is MDF1_FLT3      */
#define GPDMA1_REQUEST_MDF1_FLT4      136U     /*!< GPDMA1 HW request is MDF1_FLT4      */
#define GPDMA1_REQUEST_MDF1_FLT5      137U     /*!< GPDMA1 HW request is MDF1_FLT5      */

#define GPDMA1_REQUEST_UCPD1_TX       138U     /*!< GPDMA1 HW request is UCPD1_TX       */
#define GPDMA1_REQUEST_UCPD1_RX       139U     /*!< GPDMA1 HW request is UCPD1_RX       */

#define GPDMA1_REQUEST_DCMI_PSSI      140U     /*!< GPDMA1 HW request is DCMI_PSSI      */

#define GPDMA1_REQUEST_I3C1_TC        141U     /*!< GPDMA1 HW request is I3C1_TC        */
#define GPDMA1_REQUEST_I3C1_RS        142U     /*!< GPDMA1 HW request is I3C1_RS        */

#define GPDMA1_REQUEST_I3C2_TC        143U     /*!< GPDMA1 HW request is I3C2_TC        */
#define GPDMA1_REQUEST_I3C2_RS        144U     /*!< GPDMA1 HW request is I3C2_RS        */

/* Software request */
#define DMA_REQUEST_SW                DMA_CTR2_SWREQ  /*!< DMA SW request               */


/**
  * @}
  */

/** @defgroup DMA_Block_Request DMA Block Request
  * @brief    DMA Block Request
  * @{
  */
#define DMA_BREQ_SINGLE_BURST          0x00000000U     /*!< Hardware request protocol at a single / burst level */
#define DMA_BREQ_BLOCK                 DMA_CTR2_BREQ   /*!< Hardware request protocol at a block level          */
/**
  * @}
  */

/** @defgroup DMA_Transfer_Direction DMA Transfer Direction
  * @brief    DMA transfer direction
  * @{
  */
#define DMA_PERIPH_TO_MEMORY 0x00000000U             /*!< Peripheral to memory direction */
#define DMA_MEMORY_TO_PERIPH DMA_CTR2_DREQ           /*!< Memory to peripheral direction */
#define DMA_MEMORY_TO_MEMORY DMA_CTR2_SWREQ          /*!< Memory to memory direction     */
/**
  * @}
  */

/** @defgroup DMA_Source_Increment_Mode DMA Source Increment Mode
  * @brief    DMA Source Increment Mode
  * @{
  */
#define DMA_SINC_FIXED       0x00000000U   /*!< Source fixed       single / burst */
#define DMA_SINC_INCREMENTED DMA_CTR1_SINC /*!< Source incremented single / burst */
/**
  * @}
  */

/** @defgroup DMA_Destination_Increment_Mode DMA Destination Increment Mode
  * @brief    DMA Destination Increment Mode
  * @{
  */
#define DMA_DINC_FIXED       0x00000000U   /*!< Destination fixed       single / burst */
#define DMA_DINC_INCREMENTED DMA_CTR1_DINC /*!< Destination incremented single / burst */
/**
  * @}
  */

/** @defgroup DMA_Source_Data_Width DMA Source Data Width
  * @brief    DMA Source Data Width
  * @{
  */
#define DMA_SRC_DATAWIDTH_BYTE       0x00000000U           /*!< Source data width : Byte       */
#define DMA_SRC_DATAWIDTH_HALFWORD   DMA_CTR1_SDW_LOG2_0   /*!< Source data width : HalfWord   */
#define DMA_SRC_DATAWIDTH_WORD       DMA_CTR1_SDW_LOG2_1   /*!< Source data width : Word       */
#define DMA_SRC_DATAWIDTH_DOUBLEWORD DMA_CTR1_SDW_LOG2     /*!< Source data width : DoubleWord */
/**
  * @}
  */

/** @defgroup DMA_Destination_Data_Width DMA destination Data Width
  * @brief    DMA destination Data Width
  * @{
  */
#define DMA_DEST_DATAWIDTH_BYTE       0x00000000U          /*!< Destination data width : Byte       */
#define DMA_DEST_DATAWIDTH_HALFWORD   DMA_CTR1_DDW_LOG2_0  /*!< Destination data width : HalfWord   */
#define DMA_DEST_DATAWIDTH_WORD       DMA_CTR1_DDW_LOG2_1  /*!< Destination data width : Word       */
#define DMA_DEST_DATAWIDTH_DOUBLEWORD DMA_CTR1_DDW_LOG2    /*!< Destination data width : DoubleWord */

/**
  * @}
  */

/** @defgroup DMA_Priority_Level DMA Priority Level
  * @brief    DMA Priority Level
  * @{
  */
#define DMA_LOW_PRIORITY_LOW_WEIGHT  0x00000000U    /*!< Priority level : Low Priority, Low weight  */
#define DMA_LOW_PRIORITY_MID_WEIGHT  DMA_CCR_PRIO_0 /*!< Priority level : Low Priority, Mid weight  */
#define DMA_LOW_PRIORITY_HIGH_WEIGHT DMA_CCR_PRIO_1 /*!< Priority level : Low Priority, High weight */
#define DMA_HIGH_PRIORITY            DMA_CCR_PRIO   /*!< Priority level : HIGH Priority             */
/**
  * @}
  */

/** @defgroup DMA_Transfer_Allocated_Port DMA Transfer Allocated Port
  * @brief    DMA Transfer Allocated Port
  * @{
  */
#define DMA_SRC_ALLOCATED_PORT0  0x00000000U  /*!< Source allocated Port 0      */
#define DMA_SRC_ALLOCATED_PORT1  DMA_CTR1_SAP /*!< Source allocated Port 1      */
#define DMA_DEST_ALLOCATED_PORT0 0x00000000U  /*!< Destination allocated Port 0 */
#define DMA_DEST_ALLOCATED_PORT1 DMA_CTR1_DAP /*!< Destination allocated Port 1 */
/**
  * @}
  */

/** @defgroup DMA_Transfer_Event_Mode DMA Transfer Event Mode
  * @brief    DMA Transfer Event Mode
  * @{
  */
#define DMA_TCEM_BLOCK_TRANSFER          0x00000000U     /*!< The TC event is generated at the end of each block and the
                                                              HT event is generated at the half of each block         */
#define DMA_TCEM_REPEATED_BLOCK_TRANSFER DMA_CTR2_TCEM_0 /*!< The TC event is generated at the end of the repeated block
                                                              and the HT event is generated at the half of the repeated
                                                              block                                                   */
#define DMA_TCEM_EACH_LL_ITEM_TRANSFER   DMA_CTR2_TCEM_1 /*!< The TC event is generated at the end of each linked-list
                                                              item and the HT event is generated at the half of each
                                                              linked-list item                                        */
#define DMA_TCEM_LAST_LL_ITEM_TRANSFER   DMA_CTR2_TCEM   /*!< The TC event is generated at the end of the last
                                                              linked-list item and the HT event is generated at the half
                                                              of the last linked-list item                            */
/**
  * @}
  */

/** @defgroup DMA_Transfer_Mode DMA Transfer Mode
  * @brief    DMA Transfer Mode
  * @{
  */
#define DMA_NORMAL                           (0x00U)     /*!< Normal DMA transfer                    */
#define DMA_PFCTRL                    DMA_CTR2_PFREQ     /*!< HW request peripheral flow control mode */
/**
  * @}
  */

/** @defgroup DMA_ISOLATION_MODE DMA Channel isolation mode (CID filtering)
  * @brief    DMA Channel isolation enabling (CID filtering)
  * @{
  */
#define DMA_ISOLATION_OFF                      0U                /*!< DMA Channel isolation (CID filtering) is disabled */
#define DMA_ISOLATION_ON                       1U                /*!< DMA Channel isolation (CID filtering) is enabled  */

/**
  * @}
  */

